<a href="https://colab.research.google.com/github/MRS88/AI_course/blob/master/%D0%BD%D0%B5%D0%B4%D0%B5%D0%BB%D1%8F_03_Pandas_%D0%A7%D0%B0%D1%81%D1%82%D1%8C_1/Light.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Задача 1
Загрузите базу температур любым удобным способом. Выведите базу. Посчитайте число пустых записей в столбце State.

Ссылка на скачивание базы: https://drive.google.com/file/d/1bLiz_81Kb4pMryEalRe66jS38_F6vwMX/view?usp=sharing

**Решение:**

In [ ]:
import pandas as pd

data = pd.read_csv('/content/drive/My Drive/city_temperature.csv')
print(data[::10000].head(10))
print()
data['State'].isna().sum() # число пустых записей

       Region                   Country  State  ... Day  Year  AvgTemperature
0      Africa                   Algeria    NaN  ...   1  1995            64.2
10000  Africa                   Burundi    NaN  ...   4  1997           -99.0
20000  Africa                     Benin    NaN  ...  14  2011            80.1
30000  Africa  Central African Republic    NaN  ...  17  2013            72.4
40000  Africa                     Congo    NaN  ...  21  2015            82.0
50000  Africa                     Egypt    NaN  ...  24  2017            61.0
60000  Africa                  Ethiopia    NaN  ...  28  2019            59.1
70000  Africa                    Gambia    NaN  ...  23  1996            82.6
80000  Africa                    Guinea    NaN  ...  26  2000           -99.0
90000  Africa             Guinea-Bissau    NaN  ...  30  2002           -99.0

[10 rows x 8 columns]

153413

### Задача 2
Заполните пустые данные в базе словом "No". Запишите результат в ту же переменную. Выведите ее на экран.

**Решение:**

In [ ]:
data = data.fillna(value='No')
data

        Region     Country State     City  Month  Day  Year AvgTemperature
0       Africa     Algeria    No  Algiers      1    1  1995           64.2
1       Africa     Algeria    No  Algiers      1    2  1995           49.4
2       Africa     Algeria    No  Algiers      1    3  1995           48.8
3       Africa     Algeria    No  Algiers      1    4  1995           46.4
4       Africa     Algeria    No  Algiers      1    5  1995           47.9
...        ...         ...   ...      ...    ...  ...   ...            ...
153408  Africa  Mozambique    No   Maputo      8   26  2013           69.6
153409  Africa  Mozambique    No   Maputo      8   27  2013           73.8
153410  Africa  Mozambique    No   Maputo      8   28  2013           79.5
153411  Africa  Mozambique    No   Maputo      8   29  2013           77.5
153412  Africa  Mozambique    No   Maputo      8   30    20             No

[153413 rows x 8 columns]

### Задание 3

При помощи метода Pandas определите число уникальных записей в столбцах "Country", "City", "Year".

**Решение:**

In [ ]:
data[['Country', 'City', 'Year']].nunique()

Country    18
City       18
Year       28
dtype: int64

### Задача 4
При помощи библиотеки Pandas выведите строки, где в столбце "Country" встречается страна "Russia"

При помощи метода Pandas отдельно выведите число элементов в этой выборке.

**Решение:**

In [ ]:
mask = data['Country'] == 'Russia'
data[mask]

Empty DataFrame
Columns: [Region, Country, State, City, Month, Day, Year, AvgTemperature]
Index: []

### Задача 5
Создайте новый столбец температур, в котором будут записаны те же значения AvgTemperature, но в градусах Цельсия (исходная единица измерения - градусы Фаренгейта).

**Решение:**

In [ ]:
# так как есть строковые данные 'No' в столбце
try:
  celc = ((data['AvgTemperature'] - 32) * 5 / 9).round(1)
except TypeError:
  pass
data.assign(AvgTempCelc = celc)

        Region     Country State  ...  Year  AvgTemperature  AvgTempCelc
0       Africa     Algeria    No  ...  1995            64.2         17.9
1       Africa     Algeria    No  ...  1995            49.4          9.7
2       Africa     Algeria    No  ...  1995            48.8          9.3
3       Africa     Algeria    No  ...  1995            46.4          8.0
4       Africa     Algeria    No  ...  1995            47.9          8.8
...        ...         ...   ...  ...   ...             ...          ...
153408  Africa  Mozambique    No  ...  2013            69.6         20.9
153409  Africa  Mozambique    No  ...  2013            73.8         23.2
153410  Africa  Mozambique    No  ...  2013            79.5         26.4
153411  Africa  Mozambique    No  ...  2013            77.5         25.3
153412  Africa  Mozambique    No  ...    20              No          NaN

[153413 rows x 9 columns]